<?php

namespace CaesarCipher;

include 'CaesarCipher.php';

class CaesarCipherRu extends CaesarCipher
{
    /**
     * @var array
     */
    private $alphabet = [
        'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж',
        'э', 'ё', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю'
    ];

    /**
     * @var array
     */
    private $frequency = array(
        'а'=> 0.063,
        'б'=> 0.014,
        'в'=> 0.038,
        'г'=> 0.013,
        'д'=> 0.025,
        'е'=> 0.072,
        'ё' => 0.072,
        'ж'=> 0.007,
        'з'=> 0.016,
        'и'=> 0.062,
        'й'=> 0.01,
        'к'=> 0.028,
        'л'=> 0.035,
        'м'=> 0.026,
        'н'=> 0.052,
        'о'=> 0.09,
        'п'=> 0.023,
        'р'=> 0.040,
        'с'=> 0.045,
        'т'=> 0.053,
        'у'=> 0.021,
        'ф'=> 0.001,
        'х'=> 0.009,
        'ц'=> 0.004,
        'ч'=> 0.012,
        'ш'=> 0.005,
        'щ'=> 0.003,
        'ъ' => 0.015,
        'ы' => 0.017,
        'ь' => 0.015,
        'э' => 0.002,
        'ю' => 0.006,
        'я' => 0.018,
    );

    /**
     * @param string $text
     */
    public function __construct($text = '')
    {
        //$this->alphabet = range('a','z');
    }
}